bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* Disable both comparator IEs before any mux change (Rule 2) */
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);

    /* Select active ADC core and PINSEL */
    uint8_t core;
    if (floatPhase == FLOATING_PHASE_B)
    {
        core = 1;  /* AD1CH5, PINSEL fixed at 11 */
    }
    else
    {
        core = 2;  /* AD2CH1 */
        uint8_t pinsel = (floatPhase == FLOATING_PHASE_A) ? 10 : 7;
        HAL_ADC_SetHighSpeedPinsel(pinsel);
    }
    pData->hwzc.activeCore = core;

    /* Compute threshold with deadband (Rule 4).
     * Filter compensation (if enabled) shifts the threshold AWAY from neutral
     * in the direction OPPOSITE the deadband, so the comparator fires earlier
     * by an amount equal to the PCB RC filter's phase lag at this stepPeriodHR.
     * No-op when FEATURE_HWZC_FILTER_COMP=0. */
    uint16_t thresh = pData->bemf.zcThreshold;
    thresh = HWZC_ApplyFilterComp(pData, thresh, risingZc);
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    HAL_ADC_ConfigComparator(core, thresh, risingZc);

    /* Calculate blanking delay from step period.
     * In sector PI mode, use timerPeriod (the PI-controlled commutation
     * interval) as the basis so blanking scales with the actual closed-loop
     * period, not the IIR-tracked stepPeriodHR (which is paused in PI mode). */
#if FEATURE_HWZC_SECTOR_PI
    uint32_t periodForBlank = pData->hwzc.timerPeriod;
    if (periodForBlank < pData->hwzc.stepPeriodHR)
        periodForBlank = pData->hwzc.stepPeriodHR;   /* startup safety */
#else
    uint32_t periodForBlank = pData->hwzc.stepPeriodHR;
#endif
    uint32_t blankTicks = periodForBlank * HWZC_BLANKING_PERCENT / 100;
    if (blankTicks < 100) blankTicks = 100;  /* Minimum 1us blanking */

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_BLANKING;

    HAL_SCCP1_StartOneShot(blankTicks);
}

/**
 * @brief Compute commDelay from current stepPeriodHR + advance schedule.
 * Pulled out so OnBlankingExpired can pre-compute (saving ~1.5µs in the
 * latency-critical OnZcDetected ISR). Uses stepPeriodHR (IIR-filtered), so
 * pre-computing during BLANKING gives the same result as computing in
 * OnZcDetected except for the most-recent IIR update (~25% influence from
 * the just-measured interval). Acceptable tradeoff for latency.
 */
static inline uint32_t ComputeCommDelay(uint32_t stepPeriodHR,
                                        volatile uint16_t *dbgAdvanceDegOut)
{
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    uint32_t eRPM = HWZC_TICKS_TO_ERPM(stepPeriodHR);
    uint16_t advDeg;
    if (eRPM <= RT_RAMP_TARGET_ERPM)
        advDeg = TIMING_ADVANCE_MIN_DEG;
    else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
        advDeg = RT_TIMING_ADV_MAX_DEG;
    else
    {
        uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
        uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
        advDeg = TIMING_ADVANCE_MIN_DEG +
            (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                       * pos / range);
    }
    commDelay = stepPeriodHR * (30 - advDeg) / 60;
    if (dbgAdvanceDegOut) *dbgAdvanceDegOut = advDeg;
#else
    commDelay = stepPeriodHR / 2;
    (void)dbgAdvanceDegOut;
#endif
    if (commDelay < 10) commDelay = 10;
    return commDelay;
}

/**
 * @brief Blanking period expired — enable comparator and start timeout timer.
 * Called from SCCP1 ISR when phase == HWZC_BLANKING.
 */
void HWZC_OnBlankingExpired(volatile GARUDA_DATA_T *pData)
{
#if !HWZC_USE_SW_COMPARE
    uint8_t core = pData->hwzc.activeCore;

    /* Clear any stale comparator events, then enable interrupt */
    HAL_ADC_ClearComparatorFlag(core);
    HAL_ADC_EnableComparatorIE(core);
#else
    /* SW compare mode: leave the HW digital comparator IE disabled.
     * ZC detection runs in the 24 kHz ADC ISR via HWZC_OnSoftwareSample(). */
#endif

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI mode: schedule SCCP1 to fire at the autonomous commutation
     * deadline (lastCommStamp + timerPeriod). ZC events that arrive between
     * now and that deadline just timestamp lastCaptureHR; the PI math runs
     * in HWZC_OnPiPeriodExpired (dispatched from _CCT1Interrupt at phase
     * WATCHING when in PI mode). No separate timeout — a missed ZC is
     * absorbed by the PI as a non-update (timerPeriod unchanged). */
    uint32_t blankTicks = pData->hwzc.timerPeriod * HWZC_BLANKING_PERCENT / 100;
    if (blankTicks < 100) blankTicks = 100;
    uint32_t remaining = (pData->hwzc.timerPeriod > blankTicks)
                         ? (pData->hwzc.timerPeriod - blankTicks)
                         : 100;
    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_WATCHING;
    HAL_SCCP1_StartOneShot(remaining);
#else
    /* Reactive mode: SCCP1 fires as a timeout (no ZC) at 2× stepPeriodHR.
     * On real ZC, OnZcDetected restarts SCCP1 with commDelay for the
     * commutation phase. */
    uint32_t timeoutTicks = pData->hwzc.stepPeriodHR * 2;

    /* Pre-compute commDelay so the latency-critical OnZcDetected ISR can
     * skip the ~1.5µs of division/interpolation. Result is essentially the
     * same — OnZcDetected would only see a slightly different stepPeriodHR
     * after one more IIR update (25% influence). At 100k eRPM that's ~1°
     * of advance equivalent recovered. */
    pData->hwzc.cachedCommDelay = ComputeCommDelay(pData->hwzc.stepPeriodHR,
                                                    &pData->hwzc.dbgAdvanceDeg);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_WATCHING;

    HAL_SCCP1_StartOneShot(timeoutTicks);
#endif
}

/**
 * @brief ZC detected by ADC comparator.
 * Comparator IE already disabled and CMPSTAT cleared by ISR stub.
 * Records timestamp, updates step period via seqlock, schedules commutation.
 */
void HWZC_OnZcDetected(volatile GARUDA_DATA_T *pData)
{
    /* Off-time gate (PWMxH-LOW rejection) was REMOVED (2026-04-20).
     *
     * The gate added up to ~42 µs of detection latency (one full PWM cycle
     * at 24 kHz) when a real ZC happened to cross the threshold during
     * PWM OFF-time. At 118 k eRPM (sector = 85 µs) that's ~50 % of a
     * sector — the 22° TIMING_ADVANCE_MAX_DEG couldn't compensate it, and
     * the motor topped out around 88 k instead of the 118 k milestone
     * recorded at commit 868b2ff.
     *
     * The plausibility gate below (reject interval < 70 % of stepPeriodHR)
     * is sufficient alone for phantom rejection — it was what the 118 k
     * run used, and phantoms whose spacing happens to land above 70 % of
     * the expected sector are rare enough that the IIR absorbs them.
     */
    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate AND skip IIR.
     * The seeded lastZcStamp is a half-step guess based on where morph exit
     * happened to fall in the rotor cycle. The first measured interval is
     * therefore rotor-position-dependent and not representative — it can be
     * anywhere from 10% to 190% of a real step period. Accepting it blindly
     * risks (a) false reject by plausibility gate → timeout cascade → HWZC
     * disable → stall, or (b) IIR getting dragged off stepPeriodHR. Just
     * anchor lastZcStamp; the SECOND ZC gives a clean, full-step interval. */
    if (pData->hwzc.firstZcAfterEnable)
    {
        pData->hwzc.firstZcAfterEnable = false;
#if FEATURE_HWZC_SECTOR_PI
        /* PI mode: don't reschedule SCCP1 — the autonomous period timer
         * set up in OnBlankingExpired stays active. Just timestamp this
         * first capture so the next OnPiPeriodExpired can compute capValue
         * against prevCommHR. */
        pData->hwzc.lastCaptureHR = zcStamp;
        pData->hwzc.captureValid  = true;
        pData->hwzc.lastZcStamp   = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;
        HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
        /* phase stays WATCHING; SCCP1 already armed for end-of-period */
        return;
#else
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

        /* First ZC: use freshly computed commDelay since OnBlankingExpired's
         * cached value reflects the seeded stepPeriodHR which is correct here.
         * (One inline call to ComputeCommDelay — couldn't pre-compute yet.) */
        uint32_t commDelay = ComputeCommDelay(pData->hwzc.stepPeriodHR,
                                              &pData->hwzc.dbgAdvanceDeg);
        /* Gate comparator OFF during COMM_PENDING — see comment in main path */
        HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
#endif
    }

#if FEATURE_HWZC_PWM_GATE
    /* PWM-state gate: reject captures during PWM OFF time. At BEMF crossover
     * (Vapp ≈ Vbemf), the comparator fires on different signal regimes in
     * ON vs OFF windows — ON-time crossings around motor neutral (duty×Vbus/2),
     * OFF-time pseudo-crossings around 0V (all driven phases grounded, only
     * BEMF on floating phase). PI ingesting both produces ambiguous rotor
     * angle estimates → occasional 60° slip → 22A phase spike → UV cascade.
     *
     * Reads the H-side GPIO of the currently PWMing phase. In complementary
     * mode, H-side HIGH = PWM ON, H-side LOW = PWM OFF. Worst-case latency
     * at 45 kHz × 79% duty = 4.6 µs OFF time ≈ 3° at 200k eRPM. */
    {
        const COMMUTATION_STEP_T *cs = &commutationTable[pData->currentStep];
        bool pwmOn;
        if      (cs->phaseA == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 2)) != 0; /* RD2 = PWM1H */
        else if (cs->phaseB == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 0)) != 0; /* RD0 = PWM2H */
        else                                     pwmOn = (PORTC & (1u << 3)) != 0; /* RC3 = PWM3H */
        if (!pwmOn) {
            pData->hwzc.noiseRejectCount++;
            pData->hwzc.rejectsThisStep++;
            uint8_t core = pData->hwzc.activeCore;
            HAL_ADC_ClearComparatorFlag(core);
            HAL_ADC_EnableComparatorIE(core);
            return;
        }
    }
#endif

    /* INTERVAL CHECK FIRST (cheap, ~500 ns) — reorder C: kills early-arriving
     * noise before spending 3 µs on verify reads. Most PWM-ripple-driven
     * comparator re-fires happen within microseconds of the last accept,
     * so this catches them before the verify loop runs. */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval)
    {
        /* Noise — re-arm comparator, keep timeout running */
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        uint8_t core = pData->hwzc.activeCore;
        HAL_ADC_ClearComparatorFlag(core);
        HAL_ADC_EnableComparatorIE(core);
        return;
    }

#if FEATURE_HWZC_VERIFY_READS
    /* Signal-coherence verification (post-203k restructure 2026-05-26):
     * The comparator-trigger ADC sample already passed the threshold (else the
     * IRQ wouldn't have fired) — re-reading AD1CH5DATA immediately would just
     * see that same sample. Useful verification requires WAITING for the next
     * ADC conversion (SCCP3 = 1 MHz → ~1 µs cadence) then reading a fresh
     * value. A real BEMF crossing stays on the crossed side; a phantom driven
     * by PWM ripple flips back within one sample period.
     *
     * Order matters: wait FIRST, then read. With HWZC_VERIFY_READS=1 we make
     * exactly one meaningful verification at ~1 µs cost (~7° at 200k). With
     * N>1 each additional iteration adds another 1 µs and one more read.
     *
     * Active across the full RPM range — HWZC_VERIFY_SKIP_ERPM=999999 keeps
     * this loop enabled at high RPM where it's most needed (PWM ripple at the
     * BEMF passband becomes harder to distinguish from real crossings). */
    if (pData->hwzc.stepPeriodHR > HWZC_VERIFY_SKIP_TICKS) {
        uint8_t v_core = pData->hwzc.activeCore;
        int8_t  v_pol  = commutationTable[pData->currentStep].zcPolarity;
        bool    v_rising = (v_pol > 0);
        uint16_t v_thresh = pData->bemf.zcThreshold;
        if (v_rising)
            v_thresh = (v_thresh + HWZC_CMP_DEADBAND < 4095)
                       ? v_thresh + HWZC_CMP_DEADBAND : 4095;
        else
            v_thresh = (v_thresh > HWZC_CMP_DEADBAND)
                       ? v_thresh - HWZC_CMP_DEADBAND : 0;

